## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.alb.aws_lb_listener.https[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lb_listener" "https" {
      [32m+[0m[0m arn                                                                   = (known after apply)
      [32m+[0m[0m certificate_arn                                                       = "arn:aws:acm:us-east-1:901876312125:certificate/f289dabc-f38f-416e-8fe4-23a7057cdda7"
      [32m+[0m[0m id                                                                    = (known after apply)
      [32m+[0m[0m load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:us-east-1:901876312125:loadbalancer/app/ecs-webapp-alb/f6b4328f6daf03f0"
      [32m+[0m[0m port                                                                  = 443
      [32m+[0m[0m protocol                                                              = "HTTPS"
      [32m+[0m[0m routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      [32m+[0m[0m routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      [32m+[0m[0m routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      [32m+[0m[0m routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      [32m+[0m[0m routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      [32m+[0m[0m routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      [32m+[0m[0m routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      [32m+[0m[0m routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      [32m+[0m[0m routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      [32m+[0m[0m routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      [32m+[0m[0m routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      [32m+[0m[0m routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      [32m+[0m[0m routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      [32m+[0m[0m routing_http_response_access_control_max_age_header_value             = (known after apply)
      [32m+[0m[0m routing_http_response_content_security_policy_header_value            = (known after apply)
      [32m+[0m[0m routing_http_response_server_enabled                                  = (known after apply)
      [32m+[0m[0m routing_http_response_strict_transport_security_header_value          = (known after apply)
      [32m+[0m[0m routing_http_response_x_content_type_options_header_value             = (known after apply)
      [32m+[0m[0m routing_http_response_x_frame_options_header_value                    = (known after apply)
      [32m+[0m[0m ssl_policy                                                            = "ELBSecurityPolicy-TLS-1-2-2017-01"
      [32m+[0m[0m tags_all                                                              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Project"     = "sohaib-portfolio"
        }
      [32m+[0m[0m tcp_idle_timeout_seconds                                              = (known after apply)

      [32m+[0m[0m default_action {
          [32m+[0m[0m order            = (known after apply)
          [32m+[0m[0m target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:901876312125:targetgroup/ecs-webapp-tg/d2686e74b88f882b"
          [32m+[0m[0m type             = "forward"
        }

      [32m+[0m[0m mutual_authentication (known after apply)
    }

[1m  # module.ecs.aws_appautoscaling_policy.ecs_policy_cpu[0m will be created
[0m  [32m+[0m[0m resource "aws_appautoscaling_policy" "ecs_policy_cpu" {
      [32m+[0m[0m alarm_arns         = (known after apply)
      [32m+[0m[0m arn                = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "sohaib-portfolio-cpu-scaling"
      [32m+[0m[0m policy_type        = "TargetTrackingScaling"
      [32m+[0m[0m resource_id        = "service/ecs-webapp-cluster/sohaib-portfolio"
      [32m+[0m[0m scalable_dimension = "ecs:service:DesiredCount"
      [32m+[0m[0m service_namespace  = "ecs"

      [32m+[0m[0m target_tracking_scaling_policy_configuration {
          [32m+[0m[0m disable_scale_in = false
          [32m+[0m[0m target_value     = 70

          [32m+[0m[0m predefined_metric_specification {
              [32m+[0m[0m predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

[1m  # module.ecs.aws_appautoscaling_policy.ecs_policy_memory[0m will be created
[0m  [32m+[0m[0m resource "aws_appautoscaling_policy" "ecs_policy_memory" {
      [32m+[0m[0m alarm_arns         = (known after apply)
      [32m+[0m[0m arn                = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "sohaib-portfolio-memory-scaling"
      [32m+[0m[0m policy_type        = "TargetTrackingScaling"
      [32m+[0m[0m resource_id        = "service/ecs-webapp-cluster/sohaib-portfolio"
      [32m+[0m[0m scalable_dimension = "ecs:service:DesiredCount"
      [32m+[0m[0m service_namespace  = "ecs"

      [32m+[0m[0m target_tracking_scaling_policy_configuration {
          [32m+[0m[0m disable_scale_in = false
          [32m+[0m[0m target_value     = 80

          [32m+[0m[0m predefined_metric_specification {
              [32m+[0m[0m predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

[1m  # module.ecs.aws_appautoscaling_target.ecs_target[0m will be created
[0m  [32m+[0m[0m resource "aws_appautoscaling_target" "ecs_target" {
      [32m+[0m[0m arn                = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m max_capacity       = 10
      [32m+[0m[0m min_capacity       = 1
      [32m+[0m[0m resource_id        = "service/ecs-webapp-cluster/sohaib-portfolio"
      [32m+[0m[0m role_arn           = (known after apply)
      [32m+[0m[0m scalable_dimension = "ecs:service:DesiredCount"
      [32m+[0m[0m service_namespace  = "ecs"
      [32m+[0m[0m tags_all           = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Project"     = "sohaib-portfolio"
        }

      [32m+[0m[0m suspended_state (known after apply)
    }

[1m  # module.ecs.aws_ecr_lifecycle_policy.app[0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_lifecycle_policy" "app" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m rules = [
                  [32m+[0m[0m {
                      [32m+[0m[0m action       = {
                          [32m+[0m[0m type = "expire"
                        }
                      [32m+[0m[0m description  = "Keep last 5 images"
                      [32m+[0m[0m rulePriority = 1
                      [32m+[0m[0m selection    = {
                          [32m+[0m[0m countNumber = 5
                          [32m+[0m[0m countType   = "imageCountMoreThan"
                          [32m+[0m[0m tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      [32m+[0m[0m registry_id = (known after apply)
      [32m+[0m[0m repository  = "sohaibsohail/sohaib-portfolio"
    }

[1m  # module.ecs.aws_ecr_repository_policy.app[0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_repository_policy" "app" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = [
                          [32m+[0m[0m "ecr:GetDownloadUrlForLayer",
                          [32m+[0m[0m "ecr:BatchGetImage",
                        ]
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ecs-tasks.amazonaws.com"
                        }
                      [32m+[0m[0m Sid       = "AllowPull"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m registry_id = (known after apply)
      [32m+[0m[0m repository  = "sohaibsohail/sohaib-portfolio"
    }

[1m  # module.ecs.aws_ecs_service.main[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_service" "main" {
      [32m+[0m[0m availability_zone_rebalancing      = "DISABLED"
      [32m+[0m[0m cluster                            = "arn:aws:ecs:us-east-1:901876312125:cluster/ecs-webapp-cluster"
      [32m+[0m[0m deployment_maximum_percent         = 200
      [32m+[0m[0m deployment_minimum_healthy_percent = 100
      [32m+[0m[0m desired_count                      = 2
      [32m+[0m[0m enable_ecs_managed_tags            = false
      [32m+[0m[0m enable_execute_command             = false
      [32m+[0m[0m iam_role                           = (known after apply)
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m launch_type                        = "FARGATE"
      [32m+[0m[0m name                               = "sohaib-portfolio"
      [32m+[0m[0m platform_version                   = (known after apply)
      [32m+[0m[0m scheduling_strategy                = "REPLICA"
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "Name" = "sohaib-portfolio-service"
        }
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Name"        = "sohaib-portfolio-service"
          [32m+[0m[0m "Project"     = "sohaib-portfolio"
        }
      [32m+[0m[0m task_definition                    = (known after apply)
      [32m+[0m[0m triggers                           = (known after apply)
      [32m+[0m[0m wait_for_steady_state              = false

      [32m+[0m[0m load_balancer {
          [32m+[0m[0m container_name   = "sohaib-portfolio"
          [32m+[0m[0m container_port   = 5000
          [32m+[0m[0m target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:901876312125:targetgroup/ecs-webapp-tg/d2686e74b88f882b"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [32m+[0m[0m network_configuration {
          [32m+[0m[0m assign_public_ip = false
          [32m+[0m[0m security_groups  = [
              [32m+[0m[0m "sg-08e2cf57fb00515a0",
            ]
          [32m+[0m[0m subnets          = [
              [32m+[0m[0m "subnet-0a2be64cc522a0528",
              [32m+[0m[0m "subnet-0da79d414f4a43128",
            ]
        }
    }

[1m  # module.ecs.aws_ecs_task_definition.main[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_task_definition" "main" {
      [32m+[0m[0m arn                      = (known after apply)
      [32m+[0m[0m arn_without_revision     = (known after apply)
      [32m+[0m[0m container_definitions    = jsonencode(
            [
              [32m+[0m[0m {
                  [32m+[0m[0m environment      = [
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "ENV"
                          [32m+[0m[0m value = "dev"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m name  = "FLASK_SECRET_KEY"
                          [32m+[0m[0m value = "a9e5290cd2242cfc3b834590125d3399b27ad7c9fb955826563f8a757e33aef6"
                        },
                    ]
                  [32m+[0m[0m essential        = true
                  [32m+[0m[0m healthCheck      = {
                      [32m+[0m[0m command     = [
                          [32m+[0m[0m "CMD-SHELL",
                          [32m+[0m[0m "curl -f http://localhost:5000/health || exit 1",
                        ]
                      [32m+[0m[0m interval    = 30
                      [32m+[0m[0m retries     = 3
                      [32m+[0m[0m startPeriod = 60
                      [32m+[0m[0m timeout     = 5
                    }
                  [32m+[0m[0m image            = "901876312125.dkr.ecr.us-east-1.amazonaws.com/sohaibsohail/sohaib-portfolio@sha256:70662785ed6dbb08da309ff8b513b54ad091f28b19d9775ef8dffd4a529b0921"
                  [32m+[0m[0m logConfiguration = {
                      [32m+[0m[0m logDriver = "awslogs"
                      [32m+[0m[0m options   = {
                          [32m+[0m[0m awslogs-group         = "/ecs/sohaib-portfolio"
                          [32m+[0m[0m awslogs-region        = "us-east-1"
                          [32m+[0m[0m awslogs-stream-prefix = "ecs"
                        }
                    }
                  [32m+[0m[0m name             = "sohaib-portfolio"
                  [32m+[0m[0m portMappings     = [
                      [32m+[0m[0m {
                          [32m+[0m[0m containerPort = 5000
                          [32m+[0m[0m protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      [32m+[0m[0m cpu                      = "256"
      [32m+[0m[0m enable_fault_injection   = (known after apply)
      [32m+[0m[0m execution_role_arn       = "arn:aws:iam::901876312125:role/sohaib-portfolio-ecs-task-execution-role"
      [32m+[0m[0m family                   = "sohaib-portfolio"
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m memory                   = "512"
      [32m+[0m[0m network_mode             = "awsvpc"
      [32m+[0m[0m requires_compatibilities = [
          [32m+[0m[0m "FARGATE",
        ]
      [32m+[0m[0m revision                 = (known after apply)
      [32m+[0m[0m skip_destroy             = false
      [32m+[0m[0m tags                     = {
          [32m+[0m[0m "Name" = "sohaib-portfolio-task-definition"
        }
      [32m+[0m[0m tags_all                 = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Name"        = "sohaib-portfolio-task-definition"
          [32m+[0m[0m "Project"     = "sohaib-portfolio"
        }
      [32m+[0m[0m task_role_arn            = "arn:aws:iam::901876312125:role/sohaib-portfolio-ecs-task-role"
      [32m+[0m[0m track_latest             = false
    }

[1m  # module.route53.aws_acm_certificate_validation.main[0][0m will be created
[0m  [32m+[0m[0m resource "aws_acm_certificate_validation" "main" {
      [32m+[0m[0m certificate_arn         = "arn:aws:acm:us-east-1:901876312125:certificate/f289dabc-f38f-416e-8fe4-23a7057cdda7"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m validation_record_fqdns = (known after apply)

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "10m"
        }
    }

[1m  # module.route53.aws_route53_record.cert_validation["portfolio.sohaibsohail.com"][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "cert_validation" {
      [32m+[0m[0m allow_overwrite = true
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "_58dc0a17f1756d116f4b284160c8c712.portfolio.sohaibsohail.com"
      [32m+[0m[0m records         = [
          [32m+[0m[0m "_27c22ae681265da57674d6265e84cf5e.xlfgrmvvlj.acm-validations.aws.",
        ]
      [32m+[0m[0m ttl             = 60
      [32m+[0m[0m type            = "CNAME"
      [32m+[0m[0m zone_id         = (known after apply)
    }

[1m  # module.route53.aws_route53_record.main[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "main" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "portfolio.sohaibsohail.com"
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = (known after apply)

      [32m+[0m[0m alias {
          [32m+[0m[0m evaluate_target_health = true
          [32m+[0m[0m name                   = "ecs-webapp-alb-441204184.us-east-1.elb.amazonaws.com"
          [32m+[0m[0m zone_id                = "Z35SXDOTRQ7X7K"
        }
    }

[1m  # module.route53.aws_route53_zone.main[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_zone" "main" {
      [32m+[0m[0m arn                 = (known after apply)
      [32m+[0m[0m comment             = "Managed by Terraform"
      [32m+[0m[0m force_destroy       = false
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "sohaibsohail.com"
      [32m+[0m[0m name_servers        = (known after apply)
      [32m+[0m[0m primary_name_server = (known after apply)
      [32m+[0m[0m tags_all            = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Project"     = "sohaib-portfolio"
        }
      [32m+[0m[0m zone_id             = (known after apply)
    }

[1mPlan:[0m 12 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m ecr_repository_url     = "901876312125.dkr.ecr.us-east-1.amazonaws.com/sohaibsohail/sohaib-portfolio"
```
</details>